CosmOS-Creators/stm32h755_integration_HAL/CIL/src/CIL_interrupt.c
/********************************************************************************
**                                                                             **
**                         COSMOS FILE | CREATED BY HUMAN                      **
**                                                                             **
*********************************************************************************
**                       DOXYGEN DOCUMENTATION INFORMATION                     **
*****************************************************************************//**
** @file CIL_interrupt.c
*********************************************************************************
<!--                CIL_interrupt Unit Local Group Definition                 -->
*********************************************************************************	
** @defgroup Local_CIL_interrupt Local
** @ingroup CIL_interrupt_unit 
** @brief CIL_interrupt locals
** @details lorem 
********************************************************************************/
/********************************************************************************
**                           START OF THE SOURCE FILE                          **
********************************************************************************/
/********************************************************************************
**                            Include Files | Start                            **
********************************************************************************/
/* CORE interfaces */
#include "scheduler.h"

/* CIL interfaces */
#include "CIL_interrupt.h"

/* HAL interfaces */
#include "stm32h7xx_hal.h"
/********************************************************************************
**                            Include Files | Stop                             **
********************************************************************************/
/********************************************************************************
**                          Macro Definitions | Start                          **
********************************************************************************/
/********************************************************************************
  * DOXYGEN START GROUP                                                        **
  * *************************************************************************//**
  * @defgroup Macros_CIL_interrupt_c Macros
  * @ingroup Local_CIL_interrupt
  * @{    
********************************************************************************/
/********************************************************************************
  * DOXYGEN STOP GROUP                                                         **
  * *************************************************************************//**
  * @}  
  * Macros_CIL_interrupt_c  
********************************************************************************/
/********************************************************************************
**                          Macro Definitions | Stop                           **
********************************************************************************/
/********************************************************************************
**                              Variables | Start                              **
********************************************************************************/
/********************************************************************************
  * DOXYGEN START GROUP                                                        **
  * *************************************************************************//**
  * @defgroup Variables_CIL_interrupt_c Variables  
  * @ingroup Local_CIL_interrupt
  * @{    
********************************************************************************/
/********************************************************************************
  * DOXYGEN STOP GROUP                                                         **
  * *************************************************************************//**
  * @}  
  * Variables_CIL_interrupt_c  
********************************************************************************/
/********************************************************************************
**                              Variables | Stop                               **
********************************************************************************/
/********************************************************************************
**                         Function Prototypes | Start                         **
********************************************************************************/
/********************************************************************************
  * DOXYGEN DEF GROUP                                                          **
  * *************************************************************************//**
  * @defgroup Apis_CIL_interrupt_c API's  
  * @ingroup Local_CIL_interrupt
********************************************************************************/
/********************************************************************************
  * DOXYGEN START GROUP                                                        **
  * *************************************************************************//**
  * @addtogroup Getters_CIL_interrupt_c Getters  
  * @ingroup Apis_CIL_interrupt_c                                            
  * @{                                                                           
********************************************************************************/
/********************************************************************************
  * DOXYGEN STOP GROUP                                                         **
  * *************************************************************************//**
  * @}       
  * Getters_CIL_interrupt_c
********************************************************************************/
/********************************************************************************
  * DOXYGEN START GROUP                                                        **
  * *************************************************************************//**
  * @addtogroup Setters_CIL_interrupt_c Setters  
  * @ingroup Apis_CIL_interrupt_c                                            
  * @{                                                                           
********************************************************************************/
/********************************************************************************
  * DOXYGEN STOP GROUP                                                         **
  * *************************************************************************//**
  * @}    
  * Setters_CIL_interrupt_c   
********************************************************************************/
/********************************************************************************
  * DOXYGEN START GROUP                                                        **
  * *************************************************************************//**
  * @addtogroup General_CIL_interrupt_c General  
  * @ingroup Apis_CIL_interrupt_c                                            
  * @{                                                                           
********************************************************************************/
/********************************************************************************
  * DOXYGEN STOP GROUP                                                         **
  * *************************************************************************//**
  * @}
  * General_CIL_interrupt_c  
********************************************************************************/
/********************************************************************************
**                         Function Prototypes | Stop                          **
********************************************************************************/
/********************************************************************************
**                        Function Definitions | Start                         **
********************************************************************************/ 
__NAKED void PendSV_Handler(void)
{
    __asm volatile ("MRS R0,PSP");
    __asm volatile ("ISB");

    __asm volatile ("TST R14, #16");
    __asm volatile ("IT EQ"); 
    __asm volatile ("VSTMDBEQ R0!,{S16-S31}"); /* If fp is true save floating point registers on stack */
    __asm volatile ("STMDB R0!,{R4-R8,R10,R11,R14}");

    __asm volatile ("BL scheduler_scheduleNextInstance");
    __asm volatile ("ISB");

    __asm volatile ("LDMIA R0!,{R4-R8,R10,R11,R14}");
    __asm volatile ("TST R14, #16");
    __asm volatile ("IT EQ"); 
    __asm volatile ("VLDMIAEQ R0!,{S16-S31}"); /* If fp is true restore floating point registers on stack */
    __asm volatile ("MSR PSP,R0");
    __asm volatile ("ISB");

    __asm volatile ("BX R14");
}

void SysTick_Handler(){
    SCB->ICSR |= SCB_ICSR_PENDSVSET_Msk;
}

__NAKED void SVC_Handler( void )
{
    __asm volatile ("TST LR, #4");
    __asm volatile ("ITE EQ");
    __asm volatile ("MRSEQ r0, MSP");
    __asm volatile ("MRSNE r0, PSP");
    __asm volatile ( "B CIL_sysCalls_dispatcher");
}


//void MemManage_Handler(void) 
//{
//
//    __asm(
//        "MOV R4, 0x77777777\n\t"
//        "MOV R5, 0x77777777\n\t"
//    );
//}
//
//void HardFault_Handler(void)
//{
//    __asm(
//        "MOV R6, 0x77777777\n\t"
//        "MOV R7, 0x77777777\n\t"
//    );
//}
/********************************************************************************
**                        Function Definitions | Stop                          **
********************************************************************************/
/********************************************************************************
**                           END OF THE SOURCE FILE                            **
********************************************************************************/
